----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
        AutoConv2d-1         [-1, 64, 112, 112]           9,408
   AutoBatchNorm2d-2         [-1, 64, 112, 112]             128
              ReLU-3         [-1, 64, 112, 112]               0
         MaxPool2d-4           [-1, 64, 56, 56]               0
        AutoConv2d-5           [-1, 64, 56, 56]           4,096
   AutoBatchNorm2d-6           [-1, 64, 56, 56]             128
              ReLU-7           [-1, 64, 56, 56]               0
        AutoConv2d-8           [-1, 64, 56, 56]          36,864
   AutoBatchNorm2d-9           [-1, 64, 56, 56]             128
         Identity-10           [-1, 64, 56, 56]               0
             ReLU-11           [-1, 64, 56, 56]               0
         Identity-12           [-1, 64, 56, 56]               0
       AutoConv2d-13          [-1, 256, 56, 56]          16,384
  AutoBatchNorm2d-14          [-1, 256, 56, 56]             512
           Conv2d-15          [-1, 256, 56, 56]          16,384
             ReLU-16          [-1, 256, 56, 56]               0
       Bottleneck-17          [-1, 256, 56, 56]               0
       AutoConv2d-18          [-1, 128, 56, 56]          32,768
  AutoBatchNorm2d-19          [-1, 128, 56, 56]             256
             ReLU-20          [-1, 128, 56, 56]               0
       AutoConv2d-21          [-1, 128, 28, 28]         147,456
  AutoBatchNorm2d-22          [-1, 128, 28, 28]             256
         Identity-23          [-1, 128, 28, 28]               0
             ReLU-24          [-1, 128, 28, 28]               0
         Identity-25          [-1, 128, 28, 28]               0
       AutoConv2d-26          [-1, 512, 28, 28]          65,536
  AutoBatchNorm2d-27          [-1, 512, 28, 28]           1,024
           Conv2d-28          [-1, 512, 28, 28]         131,072
             ReLU-29          [-1, 512, 28, 28]               0
       Bottleneck-30          [-1, 512, 28, 28]               0
       AutoConv2d-31          [-1, 256, 28, 28]         131,072
  AutoBatchNorm2d-32          [-1, 256, 28, 28]             512
             ReLU-33          [-1, 256, 28, 28]               0
       AutoConv2d-34          [-1, 256, 14, 14]         589,824
  AutoBatchNorm2d-35          [-1, 256, 14, 14]             512
         Identity-36          [-1, 256, 14, 14]               0
             ReLU-37          [-1, 256, 14, 14]               0
         Identity-38          [-1, 256, 14, 14]               0
       AutoConv2d-39         [-1, 1024, 14, 14]         262,144
  AutoBatchNorm2d-40         [-1, 1024, 14, 14]           2,048
           Conv2d-41         [-1, 1024, 14, 14]         524,288
             ReLU-42         [-1, 1024, 14, 14]               0
       Bottleneck-43         [-1, 1024, 14, 14]               0
       AutoConv2d-44          [-1, 512, 14, 14]         524,288
  AutoBatchNorm2d-45          [-1, 512, 14, 14]           1,024
             ReLU-46          [-1, 512, 14, 14]               0
       AutoConv2d-47            [-1, 512, 7, 7]       2,359,296
  AutoBatchNorm2d-48            [-1, 512, 7, 7]           1,024
         Identity-49            [-1, 512, 7, 7]               0
             ReLU-50            [-1, 512, 7, 7]               0
         Identity-51            [-1, 512, 7, 7]               0
       AutoConv2d-52           [-1, 2048, 7, 7]       1,048,576
  AutoBatchNorm2d-53           [-1, 2048, 7, 7]           4,096
           Conv2d-54           [-1, 2048, 7, 7]       2,097,152
             ReLU-55           [-1, 2048, 7, 7]               0
       Bottleneck-56           [-1, 2048, 7, 7]               0
AdaptiveAvgPool2d-57           [-1, 2048, 1, 1]               0
          Flatten-58                 [-1, 2048]               0
SelectAdaptivePool2d-59                 [-1, 2048]               0
           Linear-60                 [-1, 1000]       2,049,000
================================================================
Total params: 10,057,256
Trainable params: 10,057,256
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 112.41
Params size (MB): 38.37
Estimated Total Size (MB): 151.35
----------------------------------------------------------------